<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | 默认缓存存储
    |--------------------------------------------------------------------------
    |
    | 缓存驱动：file / array / redis / null
    |
    */
    'default' => env('CACHE_DRIVER', 'file'),

    /*
    |--------------------------------------------------------------------------
    | 缓存存储配置
    |--------------------------------------------------------------------------
    */
    'stores' => [

        'file' => [
            'driver' => 'file',
            'path' => storage_path('cache'),
        ],

        'array' => [
            'driver' => 'array',
        ],

        'redis' => [
            'driver' => 'redis',
            'host' => env('REDIS_HOST', '127.0.0.1'),
            'port' => env('REDIS_PORT', 6379),
            'password' => env('REDIS_PASSWORD', null),
            'database' => env('REDIS_CACHE_DB', 0),
        ],

        'null' => [
            'driver' => 'null',
        ],

    ],

    /*
    |--------------------------------------------------------------------------
    | 缓存键前缀
    |--------------------------------------------------------------------------
    */
    'prefix' => env('CACHE_PREFIX', 'first_cache_'),

];
